; ===================================================================
; FH6 FocusKeeper - 自动赛事配置文件
; ===================================================================
;
; 作者: 170516901
; 视频: 【地平线6 13秒10技术点】
;   https://www.bilibili.com/video/BV1PzV26gEwM/?share_source=copy_web&vd_source=7bf46fa0cbbf72f4c209cd0991698a2a
;
; ===================================================================
;
; Mode=xxx         模式: wait(等待) / hold(按住) / tap(点按) / sequence(序列)
; Name=xxx         步骤名称(可选，显示在运行状态中)
; Duration=毫秒    这一步的总持续时间
; DelayBefore=毫秒 开始前等待的时间(可选，默认0)
;
; Mode=hold        Key=键码
; Mode=tap         Key=键码, HoldMs=按住时长, Interval=间隔
; Mode=sequence    ActionCount, A0_Key/Hold/Delay...
;
; 常用键码: W=87 A=65 S=83 D=68 X=88 E=69 Enter=13 Esc=27 Space=32
; 时间: 1秒=1000  5秒=5000  17秒=17000
;
; 流程: 按X(1秒) -> 回车(10秒) -> 回车(5秒) -> 按住W(20秒) -> 循环
;
; ===================================================================

[Profile]
Name=170516901
StepCount=4

[Step0]
Name=选择重赛
Mode=tap
Duration=1000
Key=88
HoldMs=80
Interval=2000

[Step1]
Name=确认1
Mode=tap
Duration=10000
Key=13
HoldMs=80
Interval=6000

[Step2]
Name=确认2
Mode=tap
Duration=5000
Key=13
HoldMs=80
Interval=6000

[Step3]
Name=比赛中
Mode=hold
Duration=20000
Key=87
